scripts/bak/test33.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">-1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">200</stringProp>
        <stringProp name="ThreadGroup.ramp_time">10</stringProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.duration">300</stringProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="HTTP Request1" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">[{&quot;ai&quot;:&quot;0a1b4118dd954ec3bcc69da5138bdb96&quot;,&quot;av&quot;:&quot;2.1.36&quot;,&quot;b&quot;:&quot;Web&quot;,&quot;u&quot;:&quot;ce8d5fb6-0b0a-43db-a6f7-ab8b7a68c6ff&quot;,&quot;s&quot;:&quot;f3feee14-4412-4257-9ba5-9a2e4a4e4728&quot;,&quot;t&quot;:&quot;vst&quot;,&quot;tm&quot;:1598013140093,&quot;pt&quot;:&quot;https&quot;,&quot;sh&quot;:900,&quot;sw&quot;:1440,&quot;d&quot;:&quot;docs.growingio.com&quot;,&quot;p&quot;:&quot;/&quot;,&quot;rf&quot;:&quot;&quot;,&quot;l&quot;:&quot;en&quot;},{&quot;ai&quot;:&quot;0a1b4118dd954ec3bcc69da5138bdb96&quot;,&quot;av&quot;:&quot;2.1.36&quot;,&quot;b&quot;:&quot;Web&quot;,&quot;u&quot;:&quot;ce8d5fb6-0b0a-43db-a6f7-ab8b7a68c6ff&quot;,&quot;s&quot;:&quot;f3feee14-4412-4257-9ba5-9a2e4a4e4728&quot;,&quot;t&quot;:&quot;vst&quot;,&quot;tm&quot;:1598013140093,&quot;pt&quot;:&quot;https&quot;,&quot;sh&quot;:900,&quot;sw&quot;:1440,&quot;d&quot;:&quot;docs.growingio.com&quot;,&quot;p&quot;:&quot;/&quot;,&quot;rf&quot;:&quot;&quot;,&quot;l&quot;:&quot;en&quot;}]</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">api-test-xjh.growingio.com</stringProp>
          <stringProp name="HTTPSampler.port">4433</stringProp>
          <stringProp name="HTTPSampler.protocol">https</stringProp>
          <stringProp name="HTTPSampler.path">/v3/0a1b4118dd954ec3bcc69da5138bdb96/web/pv?stm=1597991043684</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          <stringProp name="HTTPSampler.connect_timeout">10000</stringProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="HTTP Request2" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">[{&quot;ai&quot;:&quot;0a1b4118dd954ec3bcc69da5138bdb96&quot;,&quot;av&quot;:&quot;2.1.36&quot;,&quot;b&quot;:&quot;Web&quot;,&quot;u&quot;:&quot;ce8d5fb6-0b0a-43db-a6f7-ab8b7a68c6ff&quot;,&quot;s&quot;:&quot;f3feee14-4412-4257-9ba5-9a2e4a4e4728&quot;,&quot;t&quot;:&quot;vst&quot;,&quot;tm&quot;:1598013140093,&quot;pt&quot;:&quot;https&quot;,&quot;sh&quot;:900,&quot;sw&quot;:1440,&quot;d&quot;:&quot;docs.growingio.com&quot;,&quot;p&quot;:&quot;/&quot;,&quot;rf&quot;:&quot;&quot;,&quot;l&quot;:&quot;en&quot;},{&quot;ai&quot;:&quot;0a1b4118dd954ec3bcc69da5138bdb96&quot;,&quot;av&quot;:&quot;2.1.36&quot;,&quot;b&quot;:&quot;Web&quot;,&quot;u&quot;:&quot;ce8d5fb6-0b0a-43db-a6f7-ab8b7a68c6ff&quot;,&quot;s&quot;:&quot;f3feee14-4412-4257-9ba5-9a2e4a4e4728&quot;,&quot;t&quot;:&quot;vst&quot;,&quot;tm&quot;:1598013140093,&quot;pt&quot;:&quot;https&quot;,&quot;sh&quot;:900,&quot;sw&quot;:1440,&quot;d&quot;:&quot;docs.growingio.com&quot;,&quot;p&quot;:&quot;/&quot;,&quot;rf&quot;:&quot;&quot;,&quot;l&quot;:&quot;en&quot;}]</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">api-test-xjh.growingio.com</stringProp>
          <stringProp name="HTTPSampler.port">4433</stringProp>
          <stringProp name="HTTPSampler.protocol">https</stringProp>
          <stringProp name="HTTPSampler.path">/v3/0a1b4118dd954ec3bcc69da5138bdb96/web/pv?stm=1597991043684</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">content-type</stringProp>
              <stringProp name="Header.value">application/json</stringProp>
            </elementProp>
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">user-agent</stringProp>
              <stringProp name="Header.value">Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_5) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/83.0.4103.116 Safari/537.36</stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="HTTP Request3" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">[{&quot;ai&quot;:&quot;0a1b4118dd954ec3bcc69da5138bdb96&quot;,&quot;av&quot;:&quot;2.1.36&quot;,&quot;b&quot;:&quot;Web&quot;,&quot;u&quot;:&quot;ce8d5fb6-0b0a-43db-a6f7-ab8b7a68c6ff&quot;,&quot;s&quot;:&quot;f3feee14-4412-4257-9ba5-9a2e4a4e4728&quot;,&quot;t&quot;:&quot;vst&quot;,&quot;tm&quot;:1598013140093,&quot;pt&quot;:&quot;https&quot;,&quot;sh&quot;:900,&quot;sw&quot;:1440,&quot;d&quot;:&quot;docs.growingio.com&quot;,&quot;p&quot;:&quot;/&quot;,&quot;rf&quot;:&quot;&quot;,&quot;l&quot;:&quot;en&quot;},{&quot;ai&quot;:&quot;0a1b4118dd954ec3bcc69da5138bdb96&quot;,&quot;av&quot;:&quot;2.1.36&quot;,&quot;b&quot;:&quot;Web&quot;,&quot;u&quot;:&quot;ce8d5fb6-0b0a-43db-a6f7-ab8b7a68c6ff&quot;,&quot;s&quot;:&quot;f3feee14-4412-4257-9ba5-9a2e4a4e4728&quot;,&quot;t&quot;:&quot;vst&quot;,&quot;tm&quot;:1598013140093,&quot;pt&quot;:&quot;https&quot;,&quot;sh&quot;:900,&quot;sw&quot;:1440,&quot;d&quot;:&quot;docs.growingio.com&quot;,&quot;p&quot;:&quot;/&quot;,&quot;rf&quot;:&quot;&quot;,&quot;l&quot;:&quot;en&quot;}]</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">api-test-xjh.growingio.com</stringProp>
          <stringProp name="HTTPSampler.port">4433</stringProp>
          <stringProp name="HTTPSampler.protocol">https</stringProp>
          <stringProp name="HTTPSampler.path">/v3/0a1b4118dd954ec3bcc69da5138bdb96/web/pv?stm=1597991043684</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>